#+TITLE:     Org mode pour LaTeXiens
#+AUTHOR:    Fabrice Niessen
#+EMAIL:     fni@missioncriticalit.com
#+DATE:      2012-06-13
#+Time-stamp: <2012-06-12 Tue 21:52 Fabrice on MEDIACENTER>
#+DESCRIPTION: Tout ce que vous avez toujours voulu savoir sur Org
#+KEYWORDS:  stage, latex, org mode, dunkerque
#+LANGUAGE:  fr_FR
#+OPTIONS:   H:3 num:t toc:t
#+EXPORT_EXCLUDE_TAGS: noexport

#+LaTeX_HEADER: \lstdefinelanguage{org}{%
#+LaTeX_HEADER:   morekeywords={:results, :session, :var, :noweb, :exports},
#+LaTeX_HEADER:   sensitive=false,
#+LaTeX_HEADER:   morestring=[b]",
#+LaTeX_HEADER:   morecomment=[l]{\#},
#+LaTeX_HEADER: }

#+LaTeX_HEADER: \lstdefinelanguage{dot}{%
#+LaTeX_HEADER:   morekeywords={graph},
#+LaTeX_HEADER:   sensitive=false,
#+LaTeX_HEADER: }

#+LaTeX_HEADER: \lstset{%
#+LaTeX_HEADER:   extendedchars=false,
#+LaTeX_HEADER:   inputencoding=utf8x,
#+LaTeX_HEADER:   %
#+LaTeX_HEADER:   mathescape=false,
#+LaTeX_HEADER:   escapechar=`, % allow escaping to (La)TeX mode within `..`
#+LaTeX_HEADER:   columns=flexible,
#+LaTeX_HEADER:   keepspaces=true
#+LaTeX_HEADER:   %
#+LaTeX_HEADER:   literate=
#+LaTeX_HEADER:   {á}{{\'a}}1
#+LaTeX_HEADER:   {à}{{\`a}}1
#+LaTeX_HEADER:   {â}{{\^a}}1
#+LaTeX_HEADER:   {ä}{{\"a}}1
#+LaTeX_HEADER:   {é}{{\'e}}1
#+LaTeX_HEADER:   {è}{{\`e}}1
#+LaTeX_HEADER:   {ê}{{\^e}}1
#+LaTeX_HEADER:   {ë}{{\"e}}1
#+LaTeX_HEADER:   {í}{{\'i}}1
#+LaTeX_HEADER:   {ì}{{\`i}}1
#+LaTeX_HEADER:   {î}{{\^i}}1
#+LaTeX_HEADER:   {ï}{{\"i}}1
#+LaTeX_HEADER:   {ó}{{\'o}}1
#+LaTeX_HEADER:   {ò}{{\`o}}1
#+LaTeX_HEADER:   {ô}{{\^o}}1
#+LaTeX_HEADER:   {ö}{{\"o}}1
#+LaTeX_HEADER:   {ú}{{\'u}}1
#+LaTeX_HEADER:   {ù}{{\`u}}1
#+LaTeX_HEADER:   {û}{{\^u}}1
#+LaTeX_HEADER:   {ü}{{\"u}}1
#+LaTeX_HEADER: }

#+LaTeX_HEADER: \usepackage{tikz}
#+LaTeX_HEADER: \usepackage{pgfplots}


#+LaTeX_HEADER: %the needed packages
#+LaTeX_HEADER: \usepackage[absolute,showboxes,overlay]{textpos}
#+LaTeX_HEADER: %\TPshowboxestrue % commenter une fois fini
*** Tableau Org dans source LaTeX

- Utiliser un environnement =comment=

  #+begin_src latex :exports code
   % BEGIN RECEIVE ORGTBL chiffresdeventes
   % END RECEIVE ORGTBL chiffresdeventes
   \begin{comment}
   #+ORGTBL: SEND chiffresdeventes orgtbl-to-latex
   | Mois    | HTVA | TVAC |
   |---------+------+------|
   | Janvier | 1300 | 1568 |
   | Février | 1280 | 1544 |
   | Mars    | 1500 | 1809 |
   |---------+------+------|
   | Total   | 4080 | 4921 |
   #+TBLFM: $3=$2*1.206;%.0f::@5$2..@5$3=vsum(@2..@4)
   % $ (optional extra dollar to keep font-lock happy)
   \ end{comment}
  #+end_src

- Appuyer sur =C-c C-c= pour exporter le tableau en LaTeX

*** Tableur

#+begin_src org :exports code
,#+ATTR_LaTeX: align=r@{~:~}r@{~\EUR}l
,| Janvier | 1300 |
,| Février | 1280 |
,| Mars    | 1500 |
,|---------+------|
,| Total   | 4080 |
,#+TBLFM: @4$2=vsum(@1..@3)
#+end_src

- =C-c *= :: Ré-appliquer les formules... pour la *ligne courante*
- =C-u C-c *= :: ... pour toutes les lignes de la table
- =C-u C-u C-c *= :: ... jusqu'à ce que la *table* soit *stable*

#+ATTR_LaTeX: align=r@{~:~}r@{~\EUR}l
| Janvier | 1300 |
| Février | 1280 |
| Mars    | 1500 |
|---------+------|
| Total   | 4080 |
#+TBLFM: @4$2=vsum(@1..@3)

